case_test_poiseuille/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0) // 0
    (30 0 0) // 1
    (30 1 0) // 2
    (0 1 0) // 3
    (0 0 0.05) // 4
    (30 0 0.05) // 5
    (30 1 0.05) // 6
    (0 1 0.05) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (7 6 2 3)
        );
    }
    floor
    {
        type wall;
        faces
        (
            (5 4 0 1)
        );
    }

    Inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    Outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (7 4 5 6)
            (0 3 2 1)
        );
    }
);


// ************************************************************************* //
