case_test_poiseuille/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       7080;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       7140;
    }
    Inlet
    {
        type            patch;
        nFaces          60;
        startFace       7200;
    }
    Outlet
    {
        type            patch;
        nFaces          60;
        startFace       7260;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7200;
        startFace       7320;
    }
)

// ************************************************************************* //
