case_test_poiseuille/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhoif rhoif [1 -3 0 0 0 0 0] 1190.;//1253.0;
rhoip rhoip [1 -3 0 0 0 0 0] 1190.;//1190.;
rhodim rhodim [1 -3 0 0 0 0 0] 1.;
a a [0 1 0 0 0 0 0] 0.001;//0.000075;
g g [0 1 -2 0 0 0 0] (0 -9.81 0);
eta0 eta0 [1 -1 -1 0 0 0 0] 0.48;
Cmax Cmax [0 0 0 0 0 0 0] 0.68;
vst vst [0 1 -1 0 0 0 0] (0. 0.01 0.);
vstdt vstdt [0 2 -1 0 0 0 0] 0.;



// ************************************************************************* //
