case_test_poiseuille/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3600
(
(0.172102 1.66548e-09 0)
(0.172102 2.42947e-09 0)
(0.172101 1.42906e-09 0)
(0.172101 1.65382e-09 0)
(0.172101 1.26044e-09 0)
(0.172101 1.01523e-09 0)
(0.172101 8.54947e-10 0)
(0.172101 7.61843e-10 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    floor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
60
(
(0.172102 0 0)
(0.504828 0 0)
(0.826076 0 0)
(1.13585 0 0)
(1.43414 0 0)
(1.72096 0 0)
(1.9963 0 0)
(2.26016 0 0)
...
)
;
    }
    Outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
