case_test_poiseuille/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 0.9;
}

gradSchemes
{
    default         Gauss linear;

}

divSchemes
{
    default         Gauss linear;
    div(phi,C)      Gauss vanLeer;	       
}

laplacianSchemes
{
    default         Gauss linear orthogonal;

}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}



// ************************************************************************* //
